garyPenhook/PyAvrOCD/svd/atmega406.svd
        <register>
          <name>BPSCD</name>
          <description>Battery Protection Short-Circuit Detection Level Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCDL</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_100V</name>
                  <description>0.100V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_110V</name>
                  <description>0.110V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_120V</name>
                  <description>0.120V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_130V</name>
                  <description>0.130V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_140V</name>
                  <description>0.140V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_160V</name>
                  <description>0.160V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_180V</name>
                  <description>0.180V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_200V</name>
                  <description>0.200V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_220V</name>
                  <description>0.220V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_240V</name>
                  <description>0.240V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_260V</name>
                  <description>0.260V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_280V</name>
                  <description>0.280V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_320V</name>
                  <description>0.320V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_360V</name>
                  <description>0.360V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_400V</name>
                  <description>0.400V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_440V</name>
                  <description>0.440V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CBPTR</name>
          <description>Current Battery Protection Timing Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCPT</name>
              <description>No Description.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_MS</name>
                  <description>1 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_MS</name>
                  <description>2 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_MS</name>
                  <description>4 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_MS</name>
                  <description>6 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_MS</name>
                  <description>8 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_MS</name>
                  <description>10 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_MS</name>
                  <description>12 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14_MS</name>
                  <description>14 ms</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_MS</name>
                  <description>16 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18_MS</name>
                  <description>18 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20_MS</name>
                  <description>20 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22_MS</name>
                  <description>22 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24_MS</name>
                  <description>24 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26_MS</name>
                  <description>26 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28_MS</name>
                  <description>28 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30_MS</name>
                  <description>30 ms</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCPT</name>
              <description>No Description.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>61_US</name>
                  <description>61 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>122_US</name>
                  <description>122 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>183_US</name>
                  <description>183 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>244_US</name>
                  <description>244 us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>305_US</name>
                  <description>305 us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>366_US</name>
                  <description>366 us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>427_US</name>
                  <description>427 us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>488_US</name>
                  <description>488 us</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>610_US</name>
                  <description>610 us</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>732_US</name>
                  <description>732 us</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>854_US</name>
                  <description>854 us</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>976_US</name>
                  <description>976 us</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1098_US</name>
                  <description>1098 us</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1220_US</name>
                  <description>1220 us</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1342_US</name>
                  <description>1342 us</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1464_US</name>
                  <description>1464 us</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
