garyPenhook/PyAvrOCD/svd/atmega406.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WAKEUP_TIMER</name>
      <description>Wakeup Timer</description>
      <baseAddress>0x00800062</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WUTCSR</name>
          <description>Wake-up Timer Control Register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WUTP</name>
              <description>Wake-up Timer Prescaler Bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4K_SLOW_RC_1K_32KHZ</name>
                  <description>4K(Slow RC) / 1K (32kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K_SLOW_RC_2K_32KHZ</name>
                  <description>8K(Slow RC) / 2K (32kHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K_SLOW_RC_4K_32KHZ</name>
                  <description>16K(Slow RC) / 4K (32kHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K_SLOW_RC_8K_32KHZ</name>
                  <description>32K(Slow RC) / 8K (32kHz)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K_SLOW_RC_16K_32KHZ</name>
                  <description>64K(Slow RC) / 16K (32kHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K_SLOW_RC_32K_32KHZ</name>
                  <description>128K(Slow RC) / 32K (32kHz)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K_SLOW_RC_64K_32KHZ</name>
                  <description>256K(Slow RC) / 64K (32kHz)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K_SLOW_RC_128K_32KHZ</name>
                  <description>512K(Slow RC) / 128K (32kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUTE</name>
              <description>Wake-up Timer Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTR</name>
              <description>Wake-up Timer Reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTCF</name>
              <description>Wake-up timer Calibration Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTIE</name>
              <description>Wake-up Timer Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUTIF</name>
              <description>Wake-up Timer Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00800060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCSR</name>
          <description>Watchdog Timer Control Register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDP</name>
              <description>Watchdog Timer Prescaler Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_2K</name>
                  <description>Oscillator Cycles 2K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_4K</name>
                  <description>Oscillator Cycles 4K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_8K</name>
                  <description>Oscillator Cycles 8K</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_16K</name>
                  <description>Oscillator Cycles 16K</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_32K</name>
                  <description>Oscillator Cycles 32K</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_64K</name>
                  <description>Oscillator Cycles 64K</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_128K</name>
                  <description>Oscillator Cycles 128K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_256K</name>
                  <description>Oscillator Cycles 256K</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timeout Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>